{"data":{"markdownRemark":{"html":"<p>It's July. You've done a lot of the touristy and fun things in Seattle where you are now sitting on your bed, scrolling through the Amazon slack to find stuff to do.</p>\n<p>You stop at \"Entrepreneurial Intern Event @ Pioneer Square Labs\" and think, <em>this is something new</em>. And in bold, <strong>food and drinks provided</strong>.</p>\n<p><em>Hmm...</em></p>\n<h2>Are Meetups Pointless?</h2>\n<p>You know I'm always down for anything that is remotely associated with any free food and drink. With nothing else scheduled, this doesn't seem too bad of an event to attend. It would probably just consist of a bunch of VCs and \"CEOs\" to brag about their successes and poach aspiring developers. The very fact that this is an intern and invite-only event makes it seem that it was only organized to siphon talent from Microsoft, Amazon, etc…</p>\n<p>Looking into Reddit for what these events are like, I found <a href=\"https://www.reddit.com/r/Entrepreneur/comments/5k57y1/rant_i_am_so_tired_of_going_to_entrepreneur/\" target=\"_blank\" rel=\"noopener noreferrer\">this</a>, <a href=\"https://www.reddit.com/r/Entrepreneur/comments/6szd8b/do_real_entrepreneurs_actually_attend_meetups_for/\" target=\"_blank\" rel=\"noopener noreferrer\">this</a>, and <a href=\"https://www.reddit.com/r/Entrepreneur/comments/9uexow/advice_reddit_please/\" target=\"_blank\" rel=\"noopener noreferrer\">this</a>. It seems that these Redditors have far from a favorable view of these entrepreneurial meetups in general, one commenting \"My god, this is the largest group of self-delusional 'wantrepreneurs' I have ever met\".</p>\n<p>Not wanting to be the only one \"networking\", I got another intern on my team to tag along.</p>\n<p>Until now, my knowledge on startups and entrepreneurship just comprised of a hodgepodge of Gary Vaynerchuk videos on YouTube, Silicon Valley, and this <a href=\"https://github.com/words/buzzwords\" target=\"_blank\" rel=\"noopener noreferrer\">handy library</a> of all the obnoxious buzzwords that HR loves to throw around to woo in potential candidates on LinkedIn. In short, not very extensive so I was willing to give it a shot.</p>\n<h2>The Meetup</h2>\n<p>Pioneer Square in Seattle is known to be the founding location of Seattle, hence the word \"Pioneer\". But over the years, the area has vastly transformed which now features shopping carts filled with trash bags, worn down tents, and your local guy tripping out of his mind.</p>\n<p>In the midst of all this lies a startup studio, <a href=\"https://www.psl.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Pioneer Square Labs</a>. After walking in, an employee quickly escorted us to the third floor where other interns were mingling and drinking copious amounts of  <em>La Croix™</em>. The elevator doors opened to an open office featuring a rugged design mixed with Cedarwood running from the floor to the roof and string lights that came straight out of a college dorm featured on Instagram.</p>\n<p>\"The meetup is to my left\", said one employee and scooted us to the thing we came for, the pizza.</p>\n<p><img src=\"https://raw.githubusercontent.com/Spiderpig86/blog/master/public/images/pioneer-square-labs/pizza.jpg\" alt=\"The More You Know\"></p>\n<p>There were little clusters of different interns mingling about. Some were business and some were software engineering. In general, a good chunk of them come from companies like Microsoft and Amazon along with other startups in the region.</p>\n<p>Once we were satiated with the amount of pizza and drinks we got, the presentation finally began with an \"Omaha\" (forgive me since memory seems to fail me while writing this) which is a tradition they have in encouraging someone to give a speech. In simple terms, it's just cheering exceptionally loud from a much smaller crowd. Cute.</p>\n<p>The very first to speak was a co-founder of the incubator, <a href=\"https://www.psl.com/team/greg-gottesman\" target=\"_blank\" rel=\"noopener noreferrer\">Greg Gottesman</a>, who is also an adjunct professor at the University of Washington teaching entrepreneurship. Having found several successful companies in the past in addition to being a professor, I have no questions about his credibility.</p>\n<p>Up until now, I was only interested in killing some time and getting free food. However, it was at this point where I started to truly listen.</p>\n<p>Soon after, the CEOs of several startups spoke. What I had initially expected was an entire hour of speakers going up and boasting about their successes and throw around a bunch of fancy buzzwords that would attract young developers like myself. However, I could not have been more wrong.</p>\n<p>The main takeaway from what these speakers said was that <em>nothing in life was set in stone</em>. The founder of <strong>Glow</strong>, a platform designed to simplify podcast subscriptions, spoke about her transition from working in the US government to solve a fundamental problem in something she loved. The founder of <strong>SingleFile</strong>, a company aimed to make state and local regulations compliance much easier for starting companies, went from studying law to doing tech. As cheesy and cliche of a saying it is, the future is always full of uncertainties.</p>\n<p>The second part was more of a discussion with two current employees in PSL — one handling business operations and the other the principal data scientist. One major part of their discussion was about the process of how they vet prospective partnerships with other founders. The one thing that stuck out to me was how much data analysis was involved even in the initial stages of launching something new to prove if something was viable or not.</p>\n<p>A quick rundown of what this process looks like is:</p>\n<ol>\n<li>An initial trial run is created which consisted of many variations of the given idea marketing-wise. This means different variations of landing pages, designs, and marketing campaigns across Facebook and Google ads.</li>\n<li>After some time, the <strong>CTR</strong> (click-through rate) is assessed and a decision is made for continuing the idea. Most ideas that don't do well tend to end here.</li>\n<li>Additional optimizations are made and designs/ideas begin to become a lot more polished.</li>\n<li>Teams start to form where people of PSL meet with the client.</li>\n<li>At this point, the stages start to blur a bit as you meet with different partners (VCs) and begin assembling your team to help build your company.</li>\n</ol>\n<p>I can guarantee you that the process is a lot more nuanced than what I have stated above.</p>\n<p>There were some great examples of ideas that didn't work, such as a radiation detector made from RAM chips. This by softening the memory bits which hold state (0 or 1) by constantly writing and reading them over and over again. The repeated nature of reading and writing is destructive to DRAM (DDR3 and DDR4) and it is very similar to the <a href=\"https://en.wikipedia.org/wiki/Row_hammer\" target=\"_blank\" rel=\"noopener noreferrer\">row hammer</a> used for modifying bits of memory for privilege escalation. When this idea was tested out, this was only effective in weakening a very minuscule portion of memory, making the production process long and arduous.</p>\n<p>Another idea was paying someone else to pick up packages for you. That in itself opens up a whole other can of worms. Things to take into account are the people that are willing to pay someone, like their neighbor, to accept packages in the first place and security and trust concerns that may arise.</p>\n<p>When it comes to working at a startup studio like this, many positive remarks were made on the flexibility of being able to do the things that they enjoy. For instance, the data scientist stated that he was able to be a \"mad scientist\" of sorts working on a bunch of crazy new ideas and solving complex problems for clients. And these ideas are quite interesting since founders try to be as novel as they possibly can with the problems they try to solve.</p>\n<p>As the event started to wind down, the employees and co-founders started giving some great advice. The upshot from this part was that even in your early to mid-twenties, it is a great time to try out new ideas and pursue them relentlessly. The time is now to work on that idea for 6 months and see where it goes from there. The time is now to make mistakes so that it would serve as the cornerstone for any prospective startup.</p>\n<p>Although my initial intent was to go there for just the food and drinks, I ended up walking away with greater knowledge on how ideas are usually trialed and all the stages that occur even after an idea is pitched. The very idea that an entrepreneurial course was offered in any school for computer science to me is new given that my school did not have one. I firmly believe that the knowledge that could be gained in such a class teaching this very topic is tantamount to creativity in solving problems and the ability to learn quickly on your feet in this field.</p>\n<p>Despite the antagonistic view that some parts of Reddit had for such events, this one has certainly evinced that they are worthwhile. Who knows, you may meet a future mentor at one of these meetups or hear some profound speech that could have a major impact on the decisions you make later in your lifetime. </p>\n<p><strong>DISCLAIMER</strong>: I am not affiliated with PSL in any shape or form. The thoughts I have expressed here are my own.</p>","timeToRead":6,"fields":{"slug":"/posts/2019-8-29-i-was-wrong-about-startup-meetups/"},"frontmatter":{"date":"August 29, 2019","path":"/i-was-wrong-about-startup-meetups","tags":["startup","meetup","seattle","psl"],"title":"i was wrong about startup meetups","image":null,"description":"Waste of time or important stepping stone?"}},"site":{"siteMetadata":{"siteUrl":"https://spiderpig86.github.io/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/posts/2019-8-29-i-was-wrong-about-startup-meetups/","prev":{"node":{"excerpt":"After making a substantial amount of edits for my last post which totaled 3 months of on and off work, I thought that it would be the perfect time to finally post it on Medium. Medium has always been the one place where many go to read posts about…","html":"<p>After making a substantial amount of edits for my last post which totaled 3 months of on and off work, I thought that it would be the perfect time to finally post it on Medium. Medium has always been the one place where many go to read posts about various topics from self-improvement to economics and, the most important of all, software. The platform has manifested itself into a great source of knowledge filled with tutorials, discussions, and opinions from various developers in the industry. If I needed a tutorial on how to set up a microservice architecture deployed to docker and orchestrated with Kubernetes, Medium was bound to have a comprehensive guide on that.</p>\n<p>With such a large and growing community of developers, I thought that importing posts that contained links, images, and code snippets should be a synch given the widespread availability of Markdown. It is the primary markup language on most developer platforms and adoption seems to only be growing over time. Feeling confident that I am now finally done with editing, I simply created a <strong>gist</strong> with the contents of my post and clicked the <strong>import</strong> button. To my surprise, everything came out <strong>wrong</strong>.</p>\n<p>Looking through the post, it seemed that the importer worked correctly at the very beginning of the post. The title, table of contents, and first paragraph looked to be in order. Once it runs into some content written in HTML, things started to get a lot worse.  Links, images, and code snippets ended up disappearing altogether at some parts of the post. What's worse was that the importer was not able to pick up some bullets and numbered list correctly, where it either deleted some of the lines and renumbered them. A sinking feeling hit me as I realize that I had to go through editing the entire post again. This is especially gruesome on really long posts. Additional complications arise with Medium's custom formatting which is incompatible with existing Markdown posts.</p>\n<h3>The Issues</h3>\n<p>Although it may sound like I am just nitpicking here, there are quite a few limitations of the Medium editor that prevents it from reaching its fullest potential. The editor UX seems fine on the surface given the features that it offers, but one will quickly realize the number of <em>gotchas</em> that actually exist within the platform.</p>\n<p><strong>These are the few things that I feel really set Medium back as a platform for publishing:</strong></p>\n<h5>1: Nested Lists</h5>\n<p>When I first tried to convert my blog post, I thought most things would instantly be formatted correctly with only a few things needed to be adjusted here and there. One of the things I like to use to organize my content is to nest lists to create some sort of hierarchy in the information I'm presenting.</p>\n<p>All I got was a big fat <strong>nope</strong>.</p>\n<p>What ended up happening was that anything that contained a nested list was completely stripped out. Sure it can be mostly fixed by copying and pasting the information again, but there is absolutely no option in the editor to offer any means of indentation with the bullet points.</p>\n<p>I'm not the only one who feels that this is a major drawback in the editor itself. Just ask these users:</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/Medium?ref_src=twsrc%5Etfw\">@Medium</a> How does one insert nested lists (OLs or ULs) in content? First level is simple. Second level?</p>&mdash; Robert Koritnik (@robertkoritnik) <a href=\"https://twitter.com/robertkoritnik/status/520107363408572416?ref_src=twsrc%5Etfw\">October 9, 2014</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<ul>\n<li>\n<p><a href=\"https://medium.canny.io/feature-requests/p/nested-lists\" target=\"_blank\" rel=\"noopener noreferrer\">Nested List | Feature Request | Medium</a></p>\n</li>\n<li>\n<p><a href=\"https://github.com/yabwe/medium-editor/issues/666\" target=\"_blank\" rel=\"noopener noreferrer\">Create list inside of list</a></p>\n<ul>\n<li>Note that this is a discussion on a separate project.</li>\n</ul>\n</li>\n</ul>\n<p>The lack of response to writers who want these features shows you where Medium's priorities really are, which of course, is to paywall more articles.</p>\n<h5>2: Code Embedding</h5>\n<p>With many notable tech blogs hosting their content on Medium such as <strong>Treehouse</strong>, <strong>Basecamp</strong>, <strong>Slack</strong>, <strong>FreeCodeCamp</strong>, <strong>Netflix</strong>, and other publishers and independent writers, it would make sense for Medium to have its own way of embedding and displaying code to readers.</p>\n<p>In fact, Medium does; only if you are fine with settling for a plain un-highlighted gray-black block sitting in the middle of your page.</p>\n<p>This may seem like a small detail, but it makes sifting through large code snippets easier without going somewhat blind. I think it is great that Medium does support the <strong>triple backtick</strong> syntax of starting a code block since 2016, but that only scratches the surface of what code blocks can actually do.</p>\n<p>One solution that many developers and I use is to embed code snippets from other third party services like <strong>Gist</strong>, <strong>Codepen</strong>, and <strong>JSFiddle</strong>. This is <strong>much</strong> better than the existing editor implementation and better than adding images of your code since <strong>Medium does not support alternative text for visually impaired developers.</strong> [1].</p>\n<p>This seems fine, but if you have an existing blog post already written in Markdown, creating a new gist or code snippet on other services becomes a chore that doesn't need to exist in the first place. There are, however, tools like <a href=\"https://markdowntomedium.com/\" target=\"_blank\" rel=\"noopener noreferrer\">this</a> one that creates the code blocks for you, but that ultimately ends up polluting your Gist. The point is, there shouldn't be this many steps in trying to publish blog posts that contain code snippets.</p>\n<h5>3: Images? What Images?</h5>\n<p>As expected, since Medium did not support Markdown, any form of embedding images was completely stripped out after I used the <a href=\"https://medium.com/p/import\" target=\"_blank\" rel=\"noopener noreferrer\">import</a> tool, all the images got stripped out. <em>Wonderful.</em></p>\n<p>The one thing I can do about it is to upload the images one at a time, but this shouldn't even be necessary in the first place.</p>\n<p>This could easily be implemented in the editor if there was support for embedding images by only using the Markdown syntax.</p>\n<p>In addition, the support for captions for images is just simply missing, making it difficult for people who have trouble seeing.</p>\n<h5>4: Tables</h5>\n<p>This is very common in a lot of text editors already where we can easily organize our data in a series of rows and columns. It may require some more work for the Medium team to implement, but things such as embedding tables for data sets, spreadsheets, and calculations are quite important in the developer space.</p>\n<p>At least even in Wordpress, you have the option to embed tables via external plugins. The lack of this feature just makes it feel very limited.</p>\n<h5>5: Limitations in Post Design/Control</h5>\n<p>Now we cannot put Medium at fault for lacking these features. Medium is designed following the ethos of minimalism, but some of that is being stripped away with the addition of new modal dialogs and distractions floating around the article itself. These are a few things that are also quite limiting the platform as a whole:</p>\n<h6>Lack of Interactive Content</h6>\n<p>It is hard to embed visualizations powered by JS libraries like <a href=\"https://d3js.org/\" target=\"_blank\" rel=\"noopener noreferrer\">d3.js</a>. The best you can do on Medium is to just make these screenshots or link your readers to other sites to view your interactive content.</p>\n<p>This greatly limits how much information could actually be presented in Medium itself.</p>\n<h6>Custom HTML/CSS</h6>\n<p>Without being able to add custom HTML, crafting a beautiful blog post without making it look generic starts to become a challenge. The flexibility of styling the page the way you like can be made possible if Markdown was supported. In addition, custom styles would be a huge plus in allowing writers to have more variety in their posts. The one thing, however, is that the HTML must be sanitized before it can be rendered on pages to prevent XSS attacks.</p>\n<h6>Video Embeds</h6>\n<p>The only way to show videos is to link them through <em>YouTube</em> or <em>gfycat</em>. This is still debatable since these platforms do offer quite a bit of flexibility. However, they end up loading a lot of extra dependencies like JS libraries that add bandwidth and loading time. This does not make for a great mobile experience.</p>\n<h3>Benefits of Markdown</h3>\n<p>There is no question that Markdown has seen a dramatic increase in its adoption ever since its inception in 2004. It is widely adopted in many version control sites like <a href=\"https://github.com\" target=\"_blank\" rel=\"noopener noreferrer\">Github</a> and <a href=\"https://gitlab.com\" target=\"_blank\" rel=\"noopener noreferrer\">Gitlab</a>, messaging platforms like <a href=\"https://slack.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Slack</a>, project management platforms like <a href=\"https://trello.com/en-US\" target=\"_blank\" rel=\"noopener noreferrer\">Trello</a>, static site generators like <a href=\"https://www.gatsbyjs.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Gatsby</a> and <a href=\"https://jekyllrb.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Jekyll</a>, and even note-taking apps like <a href=\"https://typora.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Typora</a>. The list here is <strong>not exhaustive</strong>.</p>\n<p>Many have turned to Markdown in the recent years since it is syntactically simplistic compared to HTML, widely adopted by many tools on the web, and commonly used among marketers and tech teams. </p>\n<p>The barrier to entry, even for professionals who do not program, is substantially lower than any other markup language that exists today. And no, <em>formatting your text in Word does not count</em>. There are no extra words or letters like <code class=\"language-text\">href</code>, <code class=\"language-text\">a</code>, etc. that may be confusing and just irrelevant to a marketer in a sales agency trying to promote their product.</p>\n<p>The syntax to learn is quite small, making the output quite predictable most of the time and a lot less <strong>error prone</strong>. There is no need to fiddle around with styling your elements or trying to make sure that elements are presented correctly. Although some may view this as a downside for Markdown due to its fixed design nature, it is extremely efficient if anyone wanted to create a quick, nicely formatted document to serve as documentation for an application or just taking some quick notes. Its low verbosity means that you can spend less time typing boilerplate and more time on the actual content.</p>\n<p>To appease the technical folk, Markdown allows inline HTML to provide more flexibility in creating different layouts. If there is something that cannot be done in Markdown, you can still write HTML and your parser will understand.</p>\n<p>Like HTML, Markdown documents can be previewed instantly without having to install any other library (<em>cough</em> looking at you <strong>MiKTeX</strong> <em>cough</em>) or running any specific commands. There are a plethora of online editors for both markup languages that would present the content just fine.</p>\n<h3>Solutions?</h3>\n<blockquote>\n<p>Gee Stan, Markdown sure sounds great but there's a problem. How can I easily convert my Markdown posts to Medium?</p>\n</blockquote>\n<p>You see, this has been a big problem that many have solved, or attempted to solve I should say.</p>\n<p>In short, there is no <em>one size fits all</em> converter that could accurately convert all Markdown files into Medium's format without losing a few elements here and there. Below are a couple of ways and tools that other bloggers have taken to bridge the gap.</p>\n<h5>Markdown To Medium</h5>\n<p>This <a href=\"https://markdowntomedium.com/\" target=\"_blank\" rel=\"noopener noreferrer\">tool</a> is perhaps the one that comes closest to preserving all the formatting that you have in your posts. Not only does it automatically import your content, but it also <strong>automatically creates gist</strong> for all of your code snippets to add proper syntax highlighting. This may clutter up your gist collection, but it is a small price to pay for making publishing a blog post so much easier.</p>\n<h5>Medium Editor Markdown</h5>\n<p>This <a href=\"https://ionicabizau.github.io/medium-editor-markdown/example/\" target=\"_blank\" rel=\"noopener noreferrer\">extension</a> to <a href=\"https://yabwe.github.io/medium-editor/\" target=\"_blank\" rel=\"noopener noreferrer\">Medium Editor</a> adds Markdown and HTML editing to render content as seen in Medium. This is great if you want a quick preview on how your post may look by simply pasting your existing Markdown file.</p>\n<h5>Create Your Own Blog</h5>\n<p>It may be a drastic choice, but nonetheless viable. It's a great way to step into the world of static site generators like Gatsby, Hugo, and Jekyll. You will end up getting all the control in terms of how to style your blog, how to code it, and how to deploy it. Earlier this year (2019), <a href=\"https://www.freecodecamp.org/forum/t/we-just-launched-developer-news-heres-how-you-can-use-it/279929\" target=\"_blank\" rel=\"noopener noreferrer\">FreeCodeCamp</a> made the jump in their announcement albeit for other reasons. Nevertheless, they are not the only blog that is moving off of Medium.</p>\n<h3>References</h3>\n<ol>\n<li><a href=\"https://www.freecodecamp.org/news/how-to-add-code-to-medium-and-get-syntax-highlighting-d699761a5883/\" target=\"_blank\" rel=\"noopener noreferrer\">How to display code blocks in Medium</a></li>\n</ol>","id":"524e8e8e-4853-5648-88d0-55ddc7b4933e","fields":{"slug":"/posts/2019-7-4-why-medium-needs-markdown/"},"frontmatter":{"date":"2019-07-04T02:45:23.757Z","path":"/why-medium-needs-markdown","title":"why medium needs markdown","description":"The time for Markdown support on Medium is now.","tags":["medium","blogging","markdown","post"]}}},"next":null}}